## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.kubernetes_secret.argocd_manager will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret" "argocd_manager" {
+       data      = (sensitive value)
+       id        = (known after apply)
+       immutable = (known after apply)
+       type      = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd-manager"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # argocd_cluster.do-cinema will be created
+   resource "argocd_cluster" "do-cinema" {
+       id     = (known after apply)
+       info   = (known after apply)
+       name   = "do-cinema"
+       server = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com"

+       config {
+           bearer_token = (sensitive value)

+           tls_client_config {
+               ca_data = (sensitive)
            }
        }
    }

  # kubernetes_secret.argocd_manager will be created
+   resource "kubernetes_secret" "argocd_manager" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/service-account-token"

+       metadata {
+           annotations      = {
+               "kubernetes.io/service-account.name" = "argocd-manager"
            }
+           generation       = (known after apply)
+           name             = "argocd-manager"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_service_account.argocd_manager will be updated in-place
!   resource "kubernetes_service_account" "argocd_manager" {
        id                              = "kube-system/argocd-manager"
        # (1 unchanged attribute hidden)

+       secret {
+           name = "argocd-manager"
        }
-       secret {
-           name = "argocd-manager-token-ltlkx" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
